#
# Tap dat
#
tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/core'
tap 'homebrew/services'
tap 'inviqa/tools'
tap 'neovim/neovim'

#
# Brews
#
brew 'pkg-config'
brew 'libyaml'
brew 'openssl'
brew 'ansible'
brew 'docbook'
brew 'asciidoc'
brew 'autoconf'
brew 'automake'
brew 'boost'
brew 'cloc'
brew 'cmake'
brew 'diff-so-fancy'
brew 'dnsmasq'
brew 'faac'
brew 'gettext'
brew 'git'
brew 'x264'
brew 'lame'
brew 'xvid'
brew 'rtmpdump'
brew 'ffmpeg'
brew 'go'
brew 'fzf'
brew 'gnupg'
brew 'keybase'
brew 'libgpg-error'
brew 'libassuan'
brew 'pinentry'
brew 'lastpass-cli', args: ['with-doc', 'with-pinentry']
brew 'libav'
brew 'libtool'
brew 'mailhog'
brew 'mysql'
brew 'ruby-build'
brew 'rbenv'
brew 'thefuck'
brew 'wget'
brew 'youtube-dl', args: ['with-rtmpdump']

#
# Casks
#
cask 'adium'
cask 'adobe-reader'
cask 'alfred'
cask 'anatine'
cask 'atom'
cask 'charles'
cask 'chefdk'
cask 'dash'
cask 'docker'
cask 'electron'
cask 'firefox'
cask 'fluid'
cask 'franz'
cask 'google-chrome'
cask 'google-chrome-canary'
cask 'hem'
cask 'iterm2'
cask 'java6'
cask 'kitematic'
cask 'lastpass'
cask 'licecap'
cask 'macdown'
cask 'ngrok'
cask 'opera'
cask 'phpstorm'
cask 'rdm'
cask 'sequel-pro'
cask 'skype'
cask 'slack'
cask 'sonoair'
cask 'sonos'
cask 'spectacle'
cask 'spotify'
cask 'staruml'
cask 'sublime-text'
cask 'thyme'
cask 'toggldesktop'
cask 'transmission'
cask 'vagrant'
cask 'vagrant-manager'
cask 'virtualbox'
cask 'vlc'
