#
# Tap dat
#
tap 'caskroom/cask'
tap 'caskroom/versions'
tap 'homebrew/bundle'
tap 'homebrew/services'
tap 'inviqa/tools'

#
# Brews
#
brew 'openssl'
brew 'ansible'
brew 'gpg'
brew 'keybase'
brew 'lastpass-cli', args: ['with-pinentry', 'with-doc']
brew 'pkg-config'
brew 'dnsmasq'
brew 'git'
brew 'go'
brew 'mailhog'
brew 'mysql'
brew 'ruby-build'
brew 'rbenv'
brew 'wget'

#
# Casks
#
cask 'adium'
cask 'adobe-reader'
cask 'alfred'
cask 'atom'
cask 'charles'
cask 'chefdk'
cask 'dash'
cask 'firefox'
cask 'fluid'
cask 'google-chrome'
cask 'google-chrome-canary'
cask 'hem'
cask 'iterm2'
cask 'java6'
cask 'macdown'
cask 'ngrok'
cask 'opera'
cask 'phpstorm'
cask 'sequel-pro'
cask 'skype'
cask 'slack'
cask 'sonos'
cask 'spectacle'
cask 'spotify'
cask 'sublime-text'
cask 'thyme'
cask 'toggldesktop'
cask 'transmission'
cask 'vagrant'
cask 'virtualbox'
cask 'vlc'
